# Интерактивный тренажер по SQL

## 2. Запросы SQL к связанным таблицам

   #### Содержание 
    Введение
    2.1 Связи между таблицами
    2.2 Запросы на выборку, соединение таблиц
    2.3 Запросы корректировки, соединение таблиц
    2.4 База данных «Интернет-магазин книг», запросы на выборку
    2.5 База данных «Интернет-магазин книг», запросы корректировки
    
### Введение 

#### Установка Oracle Database и Oracle SQL Developer

- `Oracle Database` - [ПО](https://www.oracle.com/cis/database/technologies/oracle-database-software-downloads.html) объектно-реляционная система управления базами данных компании Oracle;
- `Oracle SQL Developer` - [ПО](https://www.oracle.com/database/sqldeveloper/technologies/download/) интегрированная среда разработки на языках SQL и PL/SQL, с возможностью администрирования баз данных, ориентирована на применение в среде Oracle Database.

После установки через Oracle SQL Developer переходим к настройке подключения к базе данных Oracle Database, щелкаем на + и выбираем «New Connection». В окне вводим данные пользователя, которые использовали при установки, заходим под системным username = SYS. После подключения серверу, отобразится обозреватель объектов и окно для написания SQL запросов. [Более подробней в источнике.](https://info-comp.ru/install-oracle-sql-developer)

**Следующий этап**, нужно создать нового пользователя/схему в Oracle Database для этого вводим команды SQL запросов:

```MYSQL 
/*PL/SLQ*/
ALTER SESSION SET "_ORACLE_SCRIPT"=TRUE; 
CREATE USER stepik_sql IDENTIFIED BY stepik;
```

**Второй этап**, передача Прав(Grant). [Более подробней в источнике.](https://youtu.be/lw_gny4zoEI) 

```MYSQL 
/*PL/SLQ*/
GRANT CREATE SESSION TO STEPIK_SQL;
GRANT CREATE TABLE TO STEPIK_SQL;
GRANT CREATE PROCEDURE TO STEPIK_SQL;
GRANT CREATE TRIGGER TO STEPIK_SQL;
GRANT CREATE VIEW TO STEPIK_SQL;
GRANT CREATE SEQUENCE TO STEPIK_SQL;
GRANT ALTER ANY TABLE TO STEPIK_SQL;
GRANT ALTER ANY PROCEDURE TO STEPIK_SQL;
GRANT ALTER ANY TRIGGER TO STEPIK_SQL;
GRANT ALTER PROFILE TO STEPIK_SQL;
GRANT DELETE ANY TABLE TO STEPIK_SQL;
GRANT DROP ANY TABLE TO STEPIK_SQL;
GRANT DROP ANY PROCEDURE TO STEPIK_SQL;
GRANT DROP ANY TRIGGER TO STEPIK_SQL;
GRANT DROP ANY VIEW TO STEPIK_SQL;
GRANT DROP PROFILE TO STEPIK_SQL;
```
```Python3
GRANT SELECT ON SYS.V_$SESSION TO STEPIK_SQL;
GRANT SELECT ON SYS.V_$SESSTAT TO STEPIK_SQL;
GRANT SELECT ON SYS.V_$STATNAME TO STEPIK_SQL;
GRANT SELECT ANY DICTIONARY TO STEPIK_SQL;
```
**Трейтий этап**, выделение памяти для добавления данных, в Oracle SQL Developer=>Other Users=><наш пользователь>=>Edit User=>Quotas=>USERS=>(Unlimited(V), Quota(100))=>Save

#### Подключение к Oracle Database из Jupyter Notebook

Для этого потребуется установить несколько библиотек. Для работы с Jupyter Notebook использована платформа Anaconda, все нужные библиотеки для работы были установлены именно в эту среду разработки.

##### Установка библиотек

- `ipython-sql` - [пакет](https://anaconda.org/conda-forge/ipython-sql) для работы с SQL запросами;
- `cx_oracle` - [пакет](https://anaconda.org/anaconda/cx_oracle) модуль, обеспечивает доступ к Oracle Database и соответствует спецификации API базы данных Python;
- `sqlalchemy` - ORM для работы с SQL БД.

In [1]:
import sqlalchemy

In [2]:
# 1. Cоздаем соединение, синтаксис sqlalchemy - "oracle+cx_oracle://'+user+':'+pw+'@'+host+':'+port+'/?service_name='+db'?'mode=Role")
sqlalchemy.create_engine("oracle://STEPIK_SQL:stepik@localhost:1521/orcl")

Engine(oracle://STEPIK_SQL:***@localhost:1521/orcl)

In [3]:
# 2. Загружаем extension
%load_ext sql 
#%reload_ext sql

In [4]:
# 3. Проверяем соединение
%sql oracle://STEPIK_SQL:stepik@localhost:1521/orcl

'Connected: STEPIK_SQL@orcl'

In [5]:
# 4. Проверяем какая версия Oracle Database установлена:
%sql SELECT * FROM v$version

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production', 'Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production\nVersion 19.3.0.0.0', 'Oracle Database 19c Enterprise Edition Release 19.0.0.0.0 - Production', 0)]

### 2.1 Связи между таблицами

#### Задание 2.1.1 
_Создать таблицу author следующей структуры:_

|Поле       | Тип, описание                 |
|-----------|-------------------------------|
|author_id  | INT PRIMARY KEY AUTO_INCREMENT|
|name_author|VARCHAR(50)                    |

In [11]:
%%sql

CREATE TABLE author 
(
    author_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_author VARCHAR(50)
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.1.2
_Заполнить таблицу author. В нее включить следующих авторов: Булгаков М.А. Достоевский Ф.М. Есенин С.А. Пастернак Б.Л._

```PLSQL
INSERT INTO author (name_author) VALUES ('Булгаков М.А.');
INSERT INTO author (name_author) VALUES ('Достоевский Ф.М.');
INSERT INTO author (name_author) VALUES ('Есенин С.А.');
INSERT INTO author (name_author) VALUES ('Пастернак Б.Л.');
```

_Заполнить таблицу genre. В нее включить следующие жанры: Роман, Поэзия_

```SQL
CREATE TABLE genre
(
    genre_id   INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_genre VARCHAR(50)
);

INSERT INTO genre(name_genre) VALUES ('Роман');
INSERT INTO genre(name_genre) VALUES ('Поэзия');

```

#### Задание 2.1.3
_Перепишите запрос на создание таблицы book , чтобы ее структура соответствовала структуре, показанной на логической схеме (таблица genre уже создана, порядок следования столбцов - как на логической схеме в таблице book, genre_id  - внешний ключ) . Для genre_id ограничение о недопустимости пустых значений не задавать. В качестве главной таблицы для описания поля  genre_idиспользовать таблицу genre следующей структуры:_

|Поле       | Тип, описание                 |
|-----------|-------------------------------|
|genre_id   | INT PRIMARY KEY AUTO_INCREMENT|
|name_genre |VARCHAR(30)                    |

```SQL
/*другой способ решения*/
ALTER TABLE book ADD CONSTRAINT fk_author_id FOREIGN KEY (author_id)  REFERENCES author (author_id);
ALTER TABLE book ADD CONSTRAINT fk_genre_id  FOREIGN KEY (genre_id)  REFERENCES genre (genre_id);
```

In [16]:
%%sql
 
CREATE TABLE book 
(
    book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    title VARCHAR(50), 
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2), 
    amount INT,
    CONSTRAINT fk_author_id FOREIGN KEY (author_id)  REFERENCES author (author_id),
    CONSTRAINT fk_genre_id  FOREIGN KEY (genre_id)  REFERENCES genre (genre_id)
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.1.4 
_Создать таблицу book той же структуры, что и на предыдущем шаге. Будем считать, что при удалении автора из таблицы author, должны удаляться все записи о книгах из таблицы book, написанные этим автором. А при удалении жанра из таблицы genre для соответствующей записи book установить значение Null в столбце genre_id._

In [17]:
%%sql

CREATE TABLE book 
(
    book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    title VARCHAR(50), 
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2), 
    amount INT,
    CONSTRAINT fk_author_id FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,
    CONSTRAINT fk_genre_id FOREIGN KEY (genre_id)  REFERENCES genre (genre_id) ON DELETE SET NULL
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]


```sql
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Белая гвардия', 1, 1, 540.50, 5);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Идиот', 2, 1, 460.00, 10);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Братья Карамазовы', 2, 1, 799.01, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Игрок', 2, 1, 480.50, 10);
```
#### Задание 2.1.5 
_Добавьте три последние записи (с ключевыми значениями 6, 7, 8) в таблицу book, первые 5 записей уже добавлены:_


|book_id|title                   |author_id|genre_id|price |amount|
|-------|------------------------|---------|--------|------|------|
|6      |Стихотворения и поэмы   |3        |2       |650.00|    15|
|7      |Черный человек          |3        |2       |570.20|     6|
|8      |Лирика                  |4        |2       |518.99|     2|

```sql

INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Стихотворения и поэмы', 3, 2, 650.00, 15);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Черный человек', 3, 2, 570.20, 6);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Лирика', 4, 2, 518.99, 2);
```

## 2.2 Запросы на выборку, соединение таблиц

### Структура и наполнение таблиц

![image.png](attachment:c469870f-b7db-469b-81d3-7fb24cb7ec01.png)


```SQL

Drop table book;
Drop table genre;
Drop table author;

CREATE TABLE author 
(
    author_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_author VARCHAR(50)
);

INSERT INTO author (name_author) VALUES ('Булгаков М.А.');
INSERT INTO author (name_author) VALUES ('Достоевский Ф.М.');
INSERT INTO author (name_author) VALUES ('Есенин С.А.');
INSERT INTO author (name_author) VALUES ('Пастернак Б.Л.');

CREATE TABLE genre
(
    genre_id   INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_genre VARCHAR(50)
);

INSERT INTO genre(name_genre) VALUES ('Роман');
INSERT INTO genre(name_genre) VALUES ('Поэзия');
INSERT INTO genre(name_genre) VALUES ('Приключения');

CREATE TABLE book 
(
    book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    title VARCHAR(50), 
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2), 
    amount INT,
    CONSTRAINT fk_author_id FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,
    CONSTRAINT fk_genre_id FOREIGN KEY (genre_id)  REFERENCES genre (genre_id) ON DELETE SET NULL
);

INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Белая гвардия', 1, 1, 540.50, 5);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Идиот', 2, 1, 460.00, 10);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Братья Карамазовы', 2, 1, 799.01, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Игрок', 2, 1, 480.50, 10);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Стихотворения и поэмы', 3, 2, 650.00, 15);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Черный человек', 3, 2,    570.20, 6);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Лирика', 4, 2, 518.99, 2);
```

#### Задание 2.2.1
_Вывести название, жанр и цену тех книг, количество которых больше 8, в отсортированном по убыванию цены виде._

In [35]:
%%sql

SELECT title, name_genre, price
FROM genre INNER JOIN book 
ON genre.genre_id = book.genre_id and book.amount > 8
ORDER BY price DESC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.2.2 
_Вывести все жанры, которые не представлены в книгах на складе._

In [48]:
%%sql
          
SELECT name_genre FROM book RIGHT JOIN genre ON book.genre_id = genre.genre_id
WHERE book.genre_id IS null

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Роман',), ('Поэзия',), ('Приключения',)]

#### Задание 2.2.3 
_Есть список городов, хранящийся в таблице city:_

|city_id|name_city|
|-------|---------|
|1      |Москва|
|2      |Санкт-Петербург|
|3      |Владивосток|

```sql
CREATE TABLE city
(
    city_id   INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_city VARCHAR(50)
);
INSERT INTO city(name_city) VALUES ('Москва');
INSERT INTO city(name_city) VALUES ('Санкт-Петербург');
INSERT INTO city(name_city) VALUES ('Владивосток');
```

_Необходимо в каждом городе провести выставку книг каждого автора в течение 2020 года. Дату проведения выставки выбрать случайным образом. Создать запрос, который выведет город, автора и дату проведения выставки. Последний столбец назвать Дата. Информацию вывести, отсортировав сначала в алфавитном порядке по названиям городов, а потом по убыванию дат проведения выставок._

```sql
-- MySQL
ALTER SESSION SET NLS_DATE_FORMAT = 'YYYY-MM-DD';

SELECT name_city, name_author, DATE_ADD('2020-01-01', INTERVAL FLOOR(RAND('2020-01-01') * 365) DAY) as Дата
FROM city, author
ORDER BY name_city, Дата DESC;
```

#### Задание 2.2.4
_Вывести информацию о книгах (жанр, книга, автор), относящихся к жанру, включающему слово «роман» в отсортированном по названиям книг виде_

In [49]:
%%sql

SELECT name_genre, title, name_author
FROM author INNER JOIN book ON author.author_id = book.author_id
            INNER JOIN genre ON genre.genre_id = book.genre_id
WHERE name_genre LIKE '%Роман%'
ORDER BY title

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.2.5

_Посчитать количество экземпляров  книг каждого автора из таблицы author.  Вывести тех авторов,  количество книг которых меньше 10, в отсортированном по возрастанию количества виде. Последний столбец назвать Количество_

In [56]:
%%sql

SELECT name_author, SUM(amount) AS Количество 
FROM author LEFT JOIN book ON author.author_id = book.author_id
GROUP BY name_author
HAVING SUM(amount) < 10 or SUM(amount) IS NULL
ORDER BY Количество

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', None),
 ('Пастернак Б.Л.', None),
 ('Есенин С.А.', None),
 ('Достоевский Ф.М.', None)]

#### Задание 2.2.6

_Вывести в алфавитном порядке всех авторов, которые пишут только в одном жанре. Поскольку у нас в таблицах так занесены данные, что у каждого автора книги только в одном жанре,  для этого запроса внесем изменения в таблицу book. Пусть у нас  книга Есенина «Черный человек» относится к жанру «Роман», а книга Булгакова «Белая гвардия» к «Приключениям» (эти изменения в таблицы уже внесены)._

In [57]:
%%sql

SELECT name_author 
FROM 
    author INNER JOIN book ON author.author_id = book.author_id
    INNER JOIN genre ON genre.genre_id = book.genre_id
GROUP BY name_author
HAVING COUNT(DISTINCT(name_genre)) = 1
ORDER BY name_author

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.2.7
_Вывести информацию о книгах (название книги, фамилию и инициалы автора, название жанра, цену и количество экземпляров книги), написанных в самых популярных жанрах, в отсортированном в алфавитном порядке по названию книг виде. Самым популярным считать жанр, общее количество экземпляров книг которого на складе максимально._

```sql
INSERT INTO author (name_author) VALUES ('Лермонтов М.Ю.'); 

INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Доктор Живаго', 4, 3, 740.50, 5);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Герой нашего времени', 5, 3, 570.99, 2);

```

In [59]:
%%sql

SELECT  title, name_author, name_genre, price, amount
FROM 
    author 
    INNER JOIN book ON author.author_id = book.author_id
    INNER JOIN genre ON  book.genre_id = genre.genre_id
WHERE genre.genre_id IN (
    SELECT genre_id FROM book GROUP BY genre_id HAVING SUM(amount) = (
        SELECT SUM(amount) FROM book GROUP BY genre_id FETCH FIRST 1 ROWS ONLY))
ORDER BY title

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.2.8
_Если в таблицах supply  и book есть одинаковые книги, которые имеют равную цену,  вывести их название и автора, а также посчитать общее количество экземпляров книг в таблицах supply и book,  столбцы назвать Название, Автор  и Количество._

```sql

CREATE TABLE supply
(
	supply_id INT INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
	title     VARCHAR(60),
	author    VARCHAR(50),
	price     DECIMAL(8, 2),
	amount    INT
);

INSERT INTO supply(title, author, price, amount) VALUES ('Доктор Живаго', 'Пастернак Б.Л.', 380.80, 4);
INSERT INTO supply(title, author, price, amount) VALUES ('Черный человек', 'Есенин С.А.', 570.20, 6);
INSERT INTO supply(title, author, price, amount) VALUES ('Евгений Онегин', 'Пушкин А.С.', 440.80, 5);
INSERT INTO supply(title, author, price, amount) VALUES ('Идиот', 'Достоевский Ф.М.', 360.80, 3);
```

In [60]:
%%sql

SELECT book.title as Название, name_author as Автор, book.amount+supply.amount as Количество
FROM author INNER JOIN book USING(author_id)
            INNER JOIN supply ON book.title = supply.title and book.price = supply.price

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

## 2.3 Запросы корректировки, соединение таблиц
### Структура и наполнение  таблиц:
```SQL
Drop table book;
Drop table genre;
Drop table author;
Drop table supply;

CREATE TABLE author 
(
    author_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_author VARCHAR(50)
);

INSERT INTO author (name_author) VALUES ('Булгаков М.А.');
INSERT INTO author (name_author) VALUES ('Достоевский Ф.М.');
INSERT INTO author (name_author) VALUES ('Есенин С.А.');
INSERT INTO author (name_author) VALUES ('Пастернак Б.Л.');
INSERT INTO author (name_author) VALUES ('Лермонтов М.Ю.');

CREATE TABLE genre
(
    genre_id   INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_genre VARCHAR(50)
);

INSERT INTO genre(name_genre) VALUES ('Роман');
INSERT INTO genre(name_genre) VALUES ('Поэзия');
INSERT INTO genre(name_genre) VALUES ('Приключения');

CREATE TABLE book 
(
    book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    title VARCHAR(50), 
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2), 
    amount INT,
    CONSTRAINT fk_author_id FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,
    CONSTRAINT fk_genre_id FOREIGN KEY (genre_id)  REFERENCES genre (genre_id) ON DELETE SET NULL
);

INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Белая гвардия', 1, 1, 540.50, 5);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Идиот', 2, 1, 460.00, 10);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Братья Карамазовы', 2, 1, 799.01, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Игрок', 2, 1, 480.50, 10);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Стихотворения и поэмы', 3, 2, 650.00, 15);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Черный человек', 3, 2, 570.20, 6);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Лирика', 4, 2, 518.99, 2);

CREATE TABLE supply
(
    supply_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    title VARCHAR(50),
    author VARCHAR(30),
    price DECIMAL(8,2),
    amount INT
);

INSERT INTO supply(title, author, price,amount) VALUES ('Доктор Живаго','Пастернак Б.Л.',380.80, 4);    
INSERT INTO supply(title, author, price, amount) VALUES ('Черный человек', 'Есенин С.А.', 570.20, 6);
INSERT INTO supply(title, author, price, amount) VALUES ('Белая гвардия', 'Булгаков М.А.', 540.50, 3);
INSERT INTO supply(title, author, price, amount) VALUES ('Идиот', 'Достоевский Ф.М.', 360.80, 3);
INSERT INTO supply(title, author, price, amount) VALUES ('Стихотворения и поэмы','Лермонтов М.Ю.',255.90, 4);
INSERT INTO supply(title, author, price, amount) VALUES ('Остров сокровищ','Стивенсон Р.Л.',599.99, 5);  
```

#### Задание 2.3.1

_Для книг, которые уже есть на складе (в таблице book), но по другой цене, чем в поставке (supply),  необходимо в таблице book увеличить количество на значение, указанное в поставке,  и пересчитать цену. А в таблице  supply обнулить количество этих книг. Формула для пересчета цены:_

$$ price={(p_1*k_1+p_2*k_2)\over k_1+k_2}$$

_где  $p_1, p_2$ - цена книги в таблицах book и supply;
     $k_1, k_2$ - количество книг в таблицах book и supply._

In [ ]:
UPDATE book
    INNER JOIN author USING(author_id)
    INNer JOIN supply ON book.title = supply.title 
                         and supply.author = author.name_author
SET book.price = (book.price*book.amount + supply.price*supply.amount)/(book.amount + supply.amount),
    book.amount = book.amount + supply.amount,
    supply.amount = 0
WHERE book.price <> supply.price;
SELECT * FROM book;
SELECT * FROM supply;

#### Задание 2.3.2
_Включить новых авторов в таблицу author с помощью запроса на добавление, а затем вывести все данные из таблицы author.  Новыми считаются авторы, которые есть в таблице supply, но нет в таблице author._

In [9]:
%%sql

INSERT INTO author(name_author)
SELECT supply.author
FROM 
    author 
    RIGHT JOIN supply ON author.name_author = supply.author
WHERE name_author IS NULL

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.3.3
_Добавить новые книги из таблицы supply в таблицу book на основе сформированного выше запроса. Затем вывести для просмотра таблицу book._

In [10]:
%%sql

INSERT INTO book(title, author_id, price, amount)
    SELECT title, author_id, price, amount
    FROM author INNER JOIN supply
        ON supply.author = author.name_author
    WHERE
        (title, author_id) NOT IN (
        SELECT title, book.author_id
        FROM author INNER JOIN book
            ON book.author_id = author.author_id)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.3.4
_Занести для книги «Стихотворения и поэмы» Лермонтова жанр «Поэзия», а для книги «Остров сокровищ» Стивенсона - «Приключения». (Использовать два запроса)._

```sql
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Доктор Живаго', 4, 1, 380.80, 4);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Стихотворения и поэмы', 4, NULL, 255.90, 4);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Остров сокровищ  ', 6, NULL, 599.99, 5);
```

In [11]:
%%sql

UPDATE book
SET genre_id = 
      (
       SELECT genre_id 
       FROM genre 
       WHERE name_genre = 'Поэзия'
      )
WHERE book_id = 10

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [12]:
%%sql

UPDATE book
SET genre_id = 
      (
       SELECT genre_id 
       FROM genre 
       WHERE name_genre = 'Приключения'
      )
WHERE book_id = 11

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

#### Задание 2.3.5
_Удалить всех авторов и все их книги, общее количество книг которых меньше 20._

In [13]:
%%sql
DELETE FROM author
WHERE author_id IN (    
            SELECT author_id 
            FROM book
            GROUP BY author_id 
            HAVING sum(amount) < 20
                      )

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
3 rows affected.

[]

In [21]:
%sql r1 << SELECT * FROM author
%sql r2 << SELECT * FROM book

print(r1,r2)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.
Returning data to local variable r1
 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.
Returning data to local variable r2
+-----------+------------------+
| author_id |   name_author    |
+-----------+------------------+
|     2     | Достоевский Ф.М. |
|     3     |   Есенин С.А.    |
|     5     |  Лермонтов М.Ю.  |
+-----------+------------------+ +---------+-----------------------+-----------+----------+--------+--------+
| book_id |         title         | author_id | genre_id | price  | amount |
+---------+-----------------------+-----------+----------+--------+--------+
|    3    |         Идиот         |     2     |    1     |  460   |   13   |
|    4    |   Братья Карамазовы   |     2     |    1     | 799.01 |   3    |
|    5    |         Игрок         |     2     |    1     | 480.5  |   10   |
|    6    | Стихотворения и поэмы |     3     |    2     |  650   |   15   |
|    7    |     Черный человек    |     3     |    2     | 570.2  |   12   |
+---------+-----------------------+-----------+----------+--------+--------+

#### Задание 2.3.6
_Удалить все жанры, к которым относится меньше 4-х книг. В таблице book для этих жанров установить значение Null._

In [22]:
%%sql

DELETE FROM genre
WHERE genre_id IN (    
            SELECT genre_id FROM book
            GROUP BY genre_id 
            HAVING count(title) < 4
                      )

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.

[]

In [23]:
%sql r3 << SELECT * FROM genre
%sql r4 << SELECT * FROM book

print(r3,r4)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.
Returning data to local variable r3
 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.
Returning data to local variable r4
+----------+------------+
| genre_id | name_genre |
+----------+------------+
|    1     |   Роман    |
|    2     |   Поэзия   |
+----------+------------+ +---------+-----------------------+-----------+----------+--------+--------+
| book_id |         title         | author_id | genre_id | price  | amount |
+---------+-----------------------+-----------+----------+--------+--------+
|    1    |   Мастер и Маргарита  |     1     |    1     | 670.99 |   3    |
|    2    |     Белая гвардия     |     1     |    1     | 540.5  |   12   |
|    3    |         Идиот         |     2     |    1     |  460   |   13   |
|    4    |   Братья Карамазовы   |     2     |    1     | 799.01 |   3    |
|    5    |         Игрок         |     2     |    1     | 480.5  |   10   |
|    6    | Стихотворения и поэмы |     3     |    2     |  650   |   15   |
|    7    |     Черный человек    |     3     |    2     | 570.2  |   12   |
|    8    |         Лирика        |     4     |    2     | 518.99 |   2    |
|    9    |     Доктор Живаго     |     4     |    1     | 380.8  |   4    |
|    10   | Стихотворения и поэмы |     4     |    2     | 255.9  |   4    |
|    11   |   Остров сокровищ     |     6     |   None   | 599.99 |   5    |
+---------+-----------------------+-----------+----------+--------+--------+

#### Задание 2.3.7

_Удалить всех авторов, которые пишут в жанре "Поэзия". Из таблицы book удалить все книги этих авторов. В запросе для отбора авторов использовать полное название жанра, а не его id._
```sql
--MySQL
DELETE FROM author
USING 
    author 
    INNER JOIN book ON author.author_id = book.author_id
    INNER JOIN genre ON genre.genre_id = book.genre_id
WHERE name_genre = 'Поэзия';
SELECT * FROM author;
SELECT * FROM book;
```

## 2.4 База данных «Интернет-магазин книг», запросы на выборку

### Структура и наполнение таблиц базы данных «Интернет-магазин книг»
```SQL

DROP TABLE author;
DROP TABLE genre;
DROP TABLE supply;
DROP TABLE book;
DROP TABLE city;
DROP TABLE client;
DROP TABLE buy;
DROP TABLE buy_book;
DROP TABLE step;
DROP TABLE buy_step;


CREATE TABLE author 
(
    author_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_author VARCHAR(50)
);

INSERT INTO author (name_author) VALUES ('Булгаков М.А.');
INSERT INTO author (name_author) VALUES ('Достоевский Ф.М.');
INSERT INTO author (name_author) VALUES ('Есенин С.А.');
INSERT INTO author (name_author) VALUES ('Пастернак Б.Л.');
INSERT INTO author (name_author) VALUES ('Лермонтов М.Ю.');

CREATE TABLE genre
(
    genre_id   INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_genre VARCHAR(50)
);

INSERT INTO genre(name_genre) VALUES ('Роман');
INSERT INTO genre(name_genre) VALUES ('Поэзия');
INSERT INTO genre(name_genre) VALUES ('Приключения');


CREATE TABLE book 
(
    book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY, 
    title VARCHAR(50), 
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2), 
    amount INT,
    CONSTRAINT fk_author_id FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,
    CONSTRAINT fk_genre_id FOREIGN KEY (genre_id)  REFERENCES genre (genre_id) ON DELETE SET NULL
);

INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Белая гвардия', 1, 1, 540.50, 5);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Идиот', 2, 1, 460.00, 10);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Братья Карамазовы', 2, 1, 799.01, 3);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Игрок', 2, 1, 480.50, 10);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Стихотворения и поэмы', 3, 2, 650.00, 15);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Черный человек', 3, 2, 570.20, 6);
INSERT INTO book(title, author_id, genre_id, price, amount) VALUES ('Лирика', 4, 2, 518.99, 2);


CREATE TABLE city (
    city_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_city VARCHAR(30),
    days_delivery INT
);

INSERT INTO city(name_city, days_delivery) VALUES ('Москва', 5);
INSERT INTO city(name_city, days_delivery) VALUES ('Санкт-Петербург', 3);
INSERT INTO city(name_city, days_delivery) VALUES ('Владивосток', 12);


CREATE TABLE client (
    client_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_client VARCHAR(50),
    city_id INT,
    email VARCHAR(30),
    CONSTRAINT fk_city_id FOREIGN KEY (city_id) REFERENCES city (city_id)
);

INSERT INTO client(name_client, city_id, email) VALUES ('Баранов Павел', 3, 'baranov@test');
INSERT INTO client(name_client, city_id, email) VALUES ('Абрамова Катя', 1, 'abramova@test');
INSERT INTO client(name_client, city_id, email) VALUES ('Семенонов Иван', 2, 'semenov@test');
INSERT INTO client(name_client, city_id, email) VALUES ('Яковлева Галина', 1, 'yakovleva@test');

CREATE TABLE buy(
    buy_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    buy_description VARCHAR(100),
    client_id INT,
    CONSTRAINT fk_client_id FOREIGN KEY (client_id) REFERENCES client (client_id)
);

INSERT INTO buy (buy_description, client_id) VALUES ('Доставка только вечером', 1);
INSERT INTO buy (buy_description, client_id) VALUES (NULL, 3);
INSERT INTO buy (buy_description, client_id) VALUES ('Упаковать каждую книгу по отдельности', 2);
INSERT INTO buy (buy_description, client_id) VALUES (NULL, 1);

CREATE TABLE buy_book (
    buy_book_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    buy_id INT,
    book_id INT,
    amount INT,
    CONSTRAINT fk_buy_id FOREIGN KEY (buy_id) REFERENCES buy (buy_id),
    CONSTRAINT fk_book_id FOREIGN KEY (book_id) REFERENCES book (book_id)
);

INSERT INTO buy_book(buy_id, book_id, amount) VALUES (1, 1, 1);
INSERT INTO buy_book(buy_id, book_id, amount) VALUES (1, 7, 2);
INSERT INTO buy_book(buy_id, book_id, amount) VALUES (1, 3, 1);
INSERT INTO buy_book(buy_id, book_id, amount) VALUES (2, 8, 2);
INSERT INTO buy_book(buy_id, book_id, amount) VALUES (3, 3, 2);
INSERT INTO buy_book(buy_id, book_id, amount) VALUES (3, 2, 1);
INSERT INTO buy_book(buy_id, book_id, amount) VALUES (3, 1, 1);
INSERT INTO buy_book(buy_id, book_id, amount) VALUES (4, 5, 1);

CREATE TABLE step (
    step_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    name_step VARCHAR(30)
);

INSERT INTO step(name_step) VALUES ('Оплата');
INSERT INTO step(name_step) VALUES ('Упаковка');
INSERT INTO step(name_step) VALUES ('Транспортировка');
INSERT INTO step(name_step) VALUES ('Доставка');

CREATE TABLE buy_step (
    buy_step_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    buy_id INT,
    step_id INT,
    date_step_beg DATE,
    date_step_end DATE,
    CONSTRAINT fk_buy_step_buy FOREIGN KEY (buy_id) REFERENCES buy (buy_id),
    CONSTRAINT fk_buy_step_step FOREIGN KEY (step_id) REFERENCES step (step_id)
);

ALTER SESSION SET NLS_DATE_FORMAT = 'YYYY-MM-DD';
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (1, 1, '2020-02-20', '2020-02-20');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (1, 2, '2020-02-20', '2020-02-21');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (1, 3, '2020-02-22', '2020-03-07');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (1, 4, '2020-03-08', '2020-03-08');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (2, 1, '2020-02-28', '2020-02-28');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (2, 2, '2020-02-29', '2020-03-01');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (2, 3, '2020-03-02', NULL);
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (2, 4, NULL, NULL);
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (3, 1, '2020-03-05', '2020-03-05');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (3, 2, '2020-03-05', '2020-03-06');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (3, 3, '2020-03-06', '2020-03-10');
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (3, 4, '2020-03-11', NULL);
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (4, 1, '2020-03-20', NULL);
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (4, 2, NULL, NULL);
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (4, 3, NULL, NULL);
INSERT INTO buy_step(buy_id, step_id, date_step_beg, date_step_end) VALUES (4, 4, NULL, NULL);       
```

#### Задание 2.4.1
_Вывести все заказы Баранова Павла (id заказа, какие книги, по какой цене и в каком количестве он заказал) в отсортированном по номеру заказа и названиям книг виде._

In [28]:
%%sql

SELECT buy.buy_id, title, price, buy_book.amount as amount 
FROM 
    client 
    INNER JOIN buy USING(client_id)
    INNER JOIN buy_book ON buy_book.buy_id = buy.buy_id
    INNER JOIN book ON buy_book.book_id=book.book_id

WHERE name_client ='Баранов Павел'
ORDER BY buy.buy_id, title

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Идиот', Decimal('460'), 1),
 (1, 'Мастер и Маргарита', Decimal('670.99'), 1),
 (1, 'Черный человек', Decimal('570.2'), 2),
 (4, 'Игрок', Decimal('480.5'), 1)]

#### Задание 2.4.2
_Посчитать, сколько раз была заказана каждая книга, для книги вывести ее автора (нужно посчитать, в каком количестве заказов фигурирует каждая книга).  Вывести фамилию и инициалы автора, название книги, последний столбец назвать Количество. Результат отсортировать сначала  по фамилиям авторов, а потом по названиям книг._

In [29]:
%%sql

SELECT name_author, title, COUNT(buy_book.amount) AS Количество
FROM author INNER JOIN book USING(author_id)
     LEFT JOIN buy_book USING(book_id)
GROUP BY title, name_author
ORDER BY name_author, title

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Булгаков М.А.', 'Белая гвардия', 1),
 ('Булгаков М.А.', 'Мастер и Маргарита', 2),
 ('Достоевский Ф.М.', 'Братья Карамазовы', 0),
 ('Достоевский Ф.М.', 'Игрок', 1),
 ('Достоевский Ф.М.', 'Идиот', 2),
 ('Есенин С.А.', 'Стихотворения и поэмы', 0),
 ('Есенин С.А.', 'Черный человек', 1),
 ('Пастернак Б.Л.', 'Лирика', 1)]

#### Задание 2.4.3
_Вывести города, в которых живут клиенты, оформлявшие заказы в интернет-магазине. Указать количество заказов в каждый город, этот столбец назвать Количество. Информацию вывести по убыванию количества заказов, а затем в алфавитном порядке по названию городов._

```sql
--MySQL
SELECT name_city, COUNT(buy.client_id) AS Количество
FROM city INNER JOIN client USING(city_id)
     LEFT JOIN buy USING(client_id)
     
GROUP BY name_city
ORDER BY Количество DESC, name_city;
```

#### Задание 2.4.4
_Вывести номера всех оплаченных заказов и даты, когда они были оплачены._

In [9]:
%%sql

SELECT buy_id, date_step_end
FROM step INNER JOIN buy_step USING(step_id)
WHERE name_step = 'Оплата' and date_step_end IS NOT NULL

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.4.5
_Вывести информацию о каждом заказе: его номер, кто его сформировал (фамилия пользователя) и его стоимость (сумма произведений количества заказанных книг и их цены), в отсортированном по номеру заказа виде. Последний столбец назвать Стоимость._

In [32]:
%%sql

SELECT buy_id, name_client, sum(buy_book.amount*price) AS Стоимость
FROM book INNER JOIN buy_book USING(book_id)
     INNER JOIN buy USING(buy_id)
     INNER JOIN client USING(client_id)
GROUP BY buy_id, name_client 
ORDER BY buy_id

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Баранов Павел', Decimal('2271.39')),
 (2, 'Семенонов Иван', Decimal('1037.98')),
 (3, 'Абрамова Катя', Decimal('2131.49')),
 (4, 'Баранов Павел', Decimal('480.5'))]

#### Задание 2.4.6
_Вывести номера заказов (buy_id) и названия этапов, на которых они в данный момент находятся. Если заказ доставлен –  информацию о нем не выводить. Информацию отсортировать по возрастанию buy_id._

In [39]:
%%sql

SELECT buy_id, name_step
FROM step INNER JOIN buy_step USING(step_id)
WHERE date_step_beg is not NULL and date_step_end is NULL
ORDER BY buy_id

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.4.7

_В таблице city для каждого города указано количество дней, за которые заказ может быть доставлен в этот город (рассматривается только этап "Транспортировка"). Для тех заказов, которые прошли этап транспортировки, вывести количество дней за которое заказ реально доставлен в город. А также, если заказ доставлен с опозданием, указать количество дней задержки, в противном случае вывести 0. В результат включить номер заказа (buy_id), а также вычисляемые столбцы Количество_дней и Опоздание. Информацию вывести в отсортированном по номеру заказа виде._

In [40]:
%%sql

SELECT buy_id, (date_step_end - date_step_beg) AS Количество_дней, 
    (CASE WHEN (date_step_end-date_step_beg) > days_delivery THEN (date_step_end-date_step_beg)-days_delivery
         ELSE 0 END) AS Опоздание
FROM city INNER JOIN client USING(city_id)
          INNER JOIN buy USING(client_id)
          INNER JOIN buy_step USING(buy_id)
          INNER JOIN step USING(step_id)
WHERE name_step = 'Транспортировка' and (date_step_end-date_step_beg) <> days_delivery

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.4.8
_Выбрать всех клиентов, которые заказывали книги Достоевского, информацию вывести в отсортированном по алфавиту виде. В решении используйте фамилию автора, а не его id._

In [41]:
%%sql

SELECT DISTINCT(name_client)
FROM author INNER JOIN book USING(author_id)
     INNER JOIN buy_book USING(book_id)
     INNER JOIN buy USING(buy_id)
     INNER JOIN client USING(client_id)
WHERE name_author = 'Достоевский Ф.М.'
ORDER BY name_client

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Абрамова Катя',), ('Баранов Павел',)]

#### Задание 2.4.9
_Вывести жанр (или жанры), в котором было заказано больше всего экземпляров книг, указать это количество . Последний столбец назвать Количество._

In [44]:
%%sql

SELECT name_genre, sum(buy_book.amount) AS Количество
FROM genre INNER JOIN book USING(genre_id)
           INNER JOIN buy_book USING(book_id)
GROUP BY name_genre
HAVING sum(buy_book.amount) = 
(
SELECT MAX(Количество) as Количество
FROM (SELECT name_genre, sum(buy_book.amount) as Количество
      FROM genre INNER JOIN book USING(genre_id)
                 INNER JOIN buy_book USING(book_id)
                 GROUP BY name_genre)
)

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Роман', 7)]

#### Задание 2.4.10
_Сравнить ежемесячную выручку от продажи книг за текущий и предыдущий годы. Для этого вывести год, месяц, сумму выручки в отсортированном сначала по возрастанию месяцев, затем по возрастанию лет виде. Название столбцов: Год, Месяц, Сумма._

```sql
DROP TABLE buy_archive;
CREATE TABLE buy_archive
(
    buy_archive_id INT GENERATED ALWAYS AS IDENTITY PRIMARY KEY,
    buy_id         INT,
    client_id      INT,
    book_id        INT,
    date_payment   DATE,
    price          DECIMAL(8, 2),
    amount         INT
);

INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (2, 1, 1, '2019-02-21', 2, 670.60);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (2, 1, 3, '2019-02-21', 1, 450.90);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (1, 2, 2, '2019-02-10', 2, 520.30);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (1, 2, 4, '2019-02-10', 3, 780.90);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (1, 2, 3, '2019-02-10', 1, 450.90);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (3, 4, 4, '2019-03-05', 4, 780.90);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (3, 4, 5, '2019-03-05', 2, 480.90);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (4, 1, 6, '2019-03-12', 1, 650.00);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (5, 2, 1, '2019-03-18', 2, 670.60);
INSERT INTO buy_archive (buy_id, client_id, book_id, date_payment, amount, price) VALUES (5, 2, 4, '2019-03-18', 1, 780.90);
```

In [15]:
%%sql

SELECT TO_CHAR(date_payment,'YYYY') AS Год, 
       TO_CHAR(date_payment, 'Month') AS Месяц, 
       SUM(buy_archive.price*buy_archive.amount) as Сумма 
FROM buy_archive
GROUP BY TO_CHAR(date_payment,'YYYY'), TO_CHAR(date_payment, 'Month')
UNION
SELECT TO_CHAR(date_step_end, 'YYYY') AS Год, TO_CHAR(date_step_end, 'Month') AS Месяц, sum(price*amount) as Сумма 
FROM (
        SELECT date_step_end,price, buy_book.amount as amount
        FROM book INNER JOIN buy_book USING(book_id)
                  INNER JOIN buy_step USING(buy_id)
                  INNER JOIN step USING(step_id)
        WHERE name_step = 'Оплата'
    )
GROUP BY TO_CHAR(date_step_end, 'YYYY'), TO_CHAR(date_step_end, 'Month')
HAVING 1 IS NOT NULL
ORDER BY Месяц, Год

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('2020', 'February ', Decimal('3309.37')),
 ('2020', 'March    ', Decimal('2131.49')),
 (None, None, Decimal('480.5'))]

#### Задание 2.4.11

_Для каждой отдельной книги необходимо вывести информацию о количестве проданных экземпляров и их стоимости за текущий и предыдущий год . Вычисляемые столбцы назвать Количество и Сумма. Информацию отсортировать по убыванию стоимости._

In [17]:
%%sql

SELECT title,SUM(kol) AS Количество, SUM(summ) AS Сумма 
FROM book INNER JOIN ( 
                       SELECT book_id, SUM(amount) AS kol, SUM(amount * price) AS summ 
                       FROM buy_archive 
                       GROUP BY book_id 
                       UNION 
                       SELECT book_id, SUM(buy_book.amount), SUM(buy_book.amount * book.price) 
                       FROM buy_book INNER JOIN book USING(book_id) 
                                     INNER JOIN buy_step USING(buy_id) 
                       WHERE step_id = 1 AND date_step_end IS NOT Null 
                       GROUP BY book_id
                     ) query_1 USING(book_id) 
GROUP BY title 
ORDER BY Сумма DESC

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[('Идиот', 3, 1380),
 ('Мастер и Маргарита', 2, Decimal('1341.98')),
 ('Черный человек', 2, Decimal('1140.4')),
 ('Лирика', 2, Decimal('1037.98')),
 ('Белая гвардия', 1, Decimal('540.5'))]

### 2.5 База данных «Интернет-магазин книг», запросы корректировки

#### Задание 2.5.1
_Включить нового человека в таблицу с клиентами. Его имя Попов Илья, его email popov@test, проживает он в Москве._

In [21]:
%sql INSERT INTO client(name_client, city_id, email) VALUES ('Попов Илья', 1, 'popov@test')
%sql SELECT * FROM client

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.
 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Баранов Павел', 3, 'baranov@test'),
 (2, 'Абрамова Катя', 1, 'abramova@test'),
 (3, 'Семенонов Иван', 2, 'semenov@test'),
 (4, 'Яковлева Галина', 1, 'yakovleva@test'),
 (5, 'Попов Илья', 1, 'popov@test')]

#### Задание 2.5.2
_Создать новый заказ для Попова Ильи. Его комментарий для заказа: «Связаться со мной по вопросу доставки»._

_Важно! В решении нельзя использоваться VALUES и делать отбор по client_id_

In [32]:
%sql INSERT INTO buy(buy_description, client_id) SELECT 'Связаться со мной по вопросу доставки', client_id FROM client WHERE name_client = 'Попов Илья'
%sql SELECT * FROM buy

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
1 rows affected.
 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[(1, 'Доставка только вечером', 1),
 (2, None, 3),
 (3, 'Упаковать каждую книгу по отдельности', 2),
 (4, None, 1),
 (5, 'Связаться со мной по вопросу доставки', 5)]

#### Задание 2.5.3
_В таблицу buy_book добавить заказ с номером 5. Этот заказ должен содержать книгу Пастернака «Лирика» в количестве двух экземпляров и книгу Булгакова «Белая гвардия» в одном экземпляре._

In [ ]:
%%sql

INSERT buy_book(buy_id, book_id, amount)
SELECT 5, book_id, 2
FROM author INNER JOIN book USING(author_id)
            INNER JOIN buy_book USING(book_id)
WHERE book.title = 'Лирика'

In [ ]:
%%sql 

INSERT buy_book(buy_id, book_id, amount)
SELECT 5, book_id, 1
FROM author INNER JOIN book USING(author_id)
            INNER JOIN buy_book USING(book_id)
WHERE book.title = 'Белая гвардия'

In [35]:
%sql SELECT * FROM buy_book

 * oracle://STEPIK_SQL:***@localhost:1521/orcl
0 rows affected.

[]

#### Задание 2.5.4
_Уменьшить количество тех книг на складе, которые были включены в заказ с номером 5._

In [ ]:
%%sql

UPDATE book INNER JOIN buy_book USING(book_id)
SET book.amount = book.amount - buy_book.amount
WHERE buy_book.buy_id = 5;
SELECT * FROM book

#### Задание 2.5.5
_Создать счет (таблицу buy_pay) на оплату заказа с номером 5, в который включить название книг, их автора, цену, количество заказанных книг и  стоимость. Последний столбец назвать Стоимость. Информацию в таблицу занести в отсортированном по названиям книг виде._

In [ ]:
%%sql

CREATE TABLE buy_pay AS 
SELECT title, name_author, price, buy_book.amount, price*buy_book.amount AS Стоимость
FROM author INNER JOIN book USING(author_id)
            INNER JOIN buy_book USING(book_id)
WHERE buy_id = 5
ORDER BY title;
SELECT * FROM buy_pay;

#### Задание 2.5.6
_Создать общий счет (таблицу buy_pay) на оплату заказа с номером 5. Куда включить номер заказа, количество книг в заказе (название столбца Количество) и его общую стоимость (название столбца Итого). Для решения используйте ОДИН запрос._

In [ ]:
%%sql

CREATE TABLE buy_pay AS
SELECT buy_id, SUM(buy_book.amount) AS Количество, SUM(price*buy_book.amount) AS Итого    
FROM book INNER JOIN buy_book USING(book_id)
WHERE buy_id = 5;
SELECT * FROM buy_pay;

#### Задание 2.5.7
_В таблицу buy_step для заказа с номером 5 включить все этапы из таблицы step, которые должен пройти этот заказ. В столбцы date_step_beg и date_step_end всех записей занести Null._

In [ ]:
%%sql

INSERT buy_step(buy_id, step_id, date_step_beg, date_step_end)
SELECT buy.buy_id, step_id, NULL, NULL
FROM buy CROSS JOIN step
WHERE buy.buy_id = 5;
SELECT * FROM buy_step;

#### Задание 2.5.8
_В таблицу buy_step занести дату 12.04.2020 выставления счета на оплату заказа с номером 5._

_Правильнее было бы занести не конкретную, а текущую дату. Это можно сделать с помощью функции Now(). Но при этом в разные дни будут вставляться разная дата, и задание нельзя будет проверить, поэтому  вставим дату 12.04.2020._

In [ ]:
%%sql

UPDATE buy_step
SET date_step_beg = '2020-04-12'
WHERE buy_id = 5 and step_id = 1;
SELECT * FROM buy_step
WHERE buy_id = 5;

#### Задание 2.5.9

_Завершить этап «Оплата» для заказа с номером 5, вставив в столбец date_step_end дату 13.04.2020, и начать следующий этап («Упаковка»), задав в столбце date_step_beg для этого этапа ту же дату._

_Реализовать два запроса для завершения этапа и начала следующего. Они должны быть записаны в общем виде, чтобы его можно было применять для любых этапов, изменив только текущий этап. Для примера пусть это будет этап «Оплата»._

In [ ]:
%%sql

UPDATE buy_step
SET date_step_end = '2020-04-13'
WHERE buy_id = 5 and step_id = 1;
UPDATE buy_step
SET date_step_beg = '2020-04-13'
WHERE buy_id = 5 and step_id = 2;
SELECT * FROM buy_step
WHERE buy_id = 5;